Duet3D/Duet3Expansion/src/atmel/SAMD11_DFP/1.1.70/atdf/ATSAMD11C14A.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!-- ============================================================================ -->
<!--                  Atmel Microcontroller Software Support                      -->
<!-- ============================================================================ -->
<!-- Copyright (c) 2016 Atmel Corporation,                                        -->
<!--                    a wholly owned subsidiary of Microchip Technology Inc.    -->
<!-- Licensed under the Apache License, Version 2.0 (the "License");              -->
<!-- you may not use this file except in compliance with the License.             -->
<!-- You may obtain a copy of the Licence at                                      -->
<!--                                                                              -->
<!--     http://www.apache.org/licenses/LICENSE-2.0                               -->
<!--                                                                              -->
<!-- Unless required by applicable law or agreed to in writing, software          -->
<!-- distributed under the License is distributed on an "AS IS" BASIS,            -->
<!-- WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.     -->
<!-- See the License for the specific language governing permissions and          -->
<!-- limitations under the License.                                               -->
<!-- ============================================================================ -->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="SAMD11C14A-SSU" package="SOIC14" pinout="SAMD1xC" speedmax="48000000" tempmin="-40" tempmax="85" vccmin="1.62" vccmax="3.63"/>
  </variants>
  <devices>
    <device name="ATSAMD11C14A" architecture="CORTEX-M0PLUS" family="SAMD" series="SAMD11">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="FLASH" start="0x00000000" size="0x4000" type="flash" pagesize="64" rw="RW" exec="true"/>
          <memory-segment name="USER_PAGE" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW"/>
          <memory-segment name="AUX0" start="0x00804000" size="0x100" type="user_page" pagesize="64" rw="RW"/>
          <memory-segment name="AUX1" start="0x00806000" size="0x100" type="fuses" pagesize="64" rw="R"/>
          <memory-segment name="HMCRAMC0" start="0x20000000" size="0x1000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="HPB0" start="0x40000000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="HPB1" start="0x41000000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="HPB2" start="0x42000000" size="0x10000" type="io" rw="RW"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io" rw="RW"/>
          <memory-segment name="SCS" start="0xE000E000" size="0x00001000" type="io" rw="RW"/>
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io" rw="RW"/>
        </address-space>
        <address-space id="fuses" name="fuses" start="0x00000000" size="0x10000" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="LITTLE_ENDIAN" value="1"/>
        <param name="__CM0PLUS_REV" value="0x0001"/>
        <param name="__MPU_PRESENT" value="0"/>
        <param name="__NVIC_PRIO_BITS" value="2"/>
        <param name="__VTOR_PRESENT" value="1"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
      </parameters>
      <peripherals>
        <module name="AC" id="U2205" version="1.1.1">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x42002400"/>
            <signals>
              <signal group="AIN" index="0" function="B_AC" pad="PA04"/>
              <signal group="AIN" index="1" function="B_AC" pad="PA05"/>
              <signal group="CMP" index="0" function="G" pad="PA14"/>
              <signal group="CMP" index="1" function="G" pad="PA15"/>
            </signals>
            <parameters>
              <param name="CMP_NUM" value="2"/>
              <param name="GCLK_ID_ANA" value="21"/>
              <param name="GCLK_ID_DIG" value="20"/>
              <param name="NUM_CMP" value="2"/>
              <param name="PAIRS" value="1"/>
              <param name="INSTANCE_ID" value="73"/>
            </parameters>
          </instance>
        </module>
        <module name="ADC" id="U2204" version="1.2.0">
          <instance name="ADC">
            <register-group name="ADC" name-in-module="ADC" address-space="base" offset="0x42002000"/>
            <signals>
              <signal group="AIN" index="0" function="B_ADC" pad="PA02"/>
              <signal group="AIN" index="2" function="B_ADC" pad="PA04"/>
              <signal group="AIN" index="3" function="B_ADC" pad="PA05"/>
              <signal group="AIN" index="6" function="B_ADC" pad="PA14"/>
              <signal group="AIN" index="7" function="B_ADC" pad="PA15"/>
              <signal group="VREFP" function="B_ANAREF" pad="PA04"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="18"/>
              <param name="EXTCHANNEL_MSB" value="9"/>
              <param name="GCLK_ID" value="19"/>
              <param name="RESULT_BITS" value="16"/>
              <param name="RESULT_MSB" value="15"/>
              <param name="INSTANCE_ID" value="72"/>
            </parameters>
          </instance>
        </module>
        <module name="DAC" id="U2214" version="1.1.0">
          <instance name="DAC">
            <register-group name="DAC" name-in-module="DAC" address-space="base" offset="0x42002800"/>
            <signals>
              <signal group="VOUT" function="B_DAC" pad="PA02"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_EMPTY" value="19"/>
              <param name="GCLK_ID" value="22"/>
              <param name="INSTANCE_ID" value="74"/>
            </parameters>
          </instance>
        </module>
        <module name="DMAC" id="U2223" version="1.0.0">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x41004800"/>
            <parameters>
              <param name="CH_BITS" value="3"/>
              <param name="CH_NUM" value="6"/>
              <param name="EVIN_NUM" value="4"/>
              <param name="EVOUT_NUM" value="4"/>
              <param name="LVL_BITS" value="2"/>
              <param name="LVL_NUM" value="4"/>
              <param name="TRIG_BITS" value="5"/>
              <param name="TRIG_NUM" value="20"/>
              <param name="INSTANCE_ID" value="36"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="U2209" version="2.1.1">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="33"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="U2217" version="1.0.1">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x40001800"/>
            <signals>
              <signal group="EXTINT" index="1" function="A" pad="PA15"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA30"/>
              <signal group="EXTINT" index="3" function="A" pad="PA31"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA24"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA25"/>
              <signal group="EXTINT" index="6" function="A" pad="PA08"/>
              <signal group="EXTINT" index="7" function="A" pad="PA09"/>
              <signal group="NMI" function="A" pad="PA14"/>
            </signals>
            <parameters>
              <param name="CONFIG_NUM" value="1"/>
              <param name="EXTINT_NUM" value="8"/>
              <param name="GCLK_ID" value="5"/>
              <param name="INSTANCE_ID" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="U2208" version="1.0.1">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x42000400"/>
            <parameters>
              <param name="CHANNELS" value="6"/>
              <param name="CHANNELS_BITS" value="3"/>
              <param name="CHANNELS_MSB" value="5"/>
              <param name="EXTEVT_NUM" value="0"/>
              <param name="GENERATORS" value="44"/>
              <param name="GENERATORS_BITS" value="6"/>
              <param name="USERS" value="18"/>
              <param name="USERS_BITS" value="5"/>
              <param name="INSTANCE_ID" value="65"/>
            </parameters>
          </instance>
        </module>
        <module name="GCLK" id="U2102" version="2.1.0">
          <instance name="GCLK">
            <register-group name="GCLK" name-in-module="GCLK" address-space="base" offset="0x40000C00"/>
            <signals>
              <signal group="IO" index="0" function="H" pad="PA08"/>
              <signal group="IO" index="0" function="H" pad="PA24"/>
              <signal group="IO" index="0" function="H" pad="PA25"/>
              <signal group="IO" index="0" function="H" pad="PA30"/>
              <signal group="IO" index="0" function="H" pad="PA31"/>
              <signal group="IO" index="1" function="H" pad="PA09"/>
              <signal group="IO" index="4" function="H" pad="PA14"/>
              <signal group="IO" index="5" function="H" pad="PA15"/>
            </signals>
            <parameters>
              <param name="GENDIV_BITS" value="16"/>
              <param name="GEN_NUM" value="6"/>
              <param name="GEN_NUM_MSB" value="5"/>
              <param name="GEN_SOURCE_NUM_MSB" value="8"/>
              <param name="NUM" value="24"/>
              <param name="SOURCE_DFLL48M" value="7"/>
              <param name="SOURCE_FDPLL" value="8"/>
              <param name="SOURCE_GCLKGEN1" value="2"/>
              <param name="SOURCE_GCLKIN" value="1"/>
              <param name="SOURCE_NUM" value="9"/>
              <param name="SOURCE_OSCULP32K" value="3"/>
              <param name="SOURCE_OSC8M" value="6"/>
              <param name="SOURCE_OSC32K" value="4"/>
              <param name="SOURCE_XOSC" value="0"/>
              <param name="SOURCE_XOSC32K" value="5"/>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="HMATRIXB" id="I7638" version="2.1.2">
          <instance name="SBMATRIX">
            <register-group name="SBMATRIX" name-in-module="HMATRIXB" address-space="base" offset="0x41007000"/>
            <parameters>
              <param name="MASTER_NUM" value="3"/>
              <param name="MASTER_CM0PLUS" value="0"/>
              <param name="MASTER_DSU" value="1"/>
              <param name="MASTER_DMAC" value="2"/>
              <param name="SLAVE_NUM" value="7"/>
              <param name="SLAVE_FLASH" value="0"/>
              <param name="SLAVE_HPB0" value="1"/>
              <param name="SLAVE_HPB1" value="2"/>
              <param name="SLAVE_HPB2" value="3"/>
              <param name="SLAVE_HMCRAMC0" value="4"/>
              <param name="SLAVE_HMCRAMC0_ALT0" value="5"/>
              <param name="SLAVE_HMCRAMC0_ALT1" value="6"/>
              <param name="INSTANCE_ID" value="39"/>
            </parameters>
          </instance>
        </module>
        <module name="MTB" id="U2002" version="1.0.0">
          <instance name="MTB">
            <register-group name="MTB" name-in-module="MTB" address-space="base" offset="0x41006000"/>
            <parameters>
              <param name="INSTANCE_ID" value="38"/>
            </parameters>
          </instance>
        </module>
