Duet3D/Duet3Expansion/src/atmel/SAMD11_DFP/1.1.70/atdf/ATSAMD11C14A.atdf
        <module name="PTC" id="U2215" version="1.0.4">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x42002C00"/>
            <signals>
              <signal group="X" index="0" function="B_PTC" pad="PA14"/>
              <signal group="X" index="1" function="B_PTC" pad="PA15"/>
              <signal group="X" index="8" function="B_PTC" pad="PA24"/>
              <signal group="X" index="9" function="B_PTC" pad="PA25"/>
              <signal group="Y" index="0" function="B_PTC" pad="PA02"/>
              <signal group="Y" index="2" function="B_PTC" pad="PA04"/>
              <signal group="Y" index="3" function="B_PTC" pad="PA05"/>
              <signal group="Y" index="6" function="B_PTCXY" pad="PA14"/>
              <signal group="Y" index="7" function="B_PTCXY" pad="PA15"/>
              <signal group="Y" index="14" function="B_PTCXY" pad="PA24"/>
              <signal group="Y" index="15" function="B_PTCXY" pad="PA25"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="23"/>
              <param name="INSTANCE_ID" value="75"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2202" version="1.0.1">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40001400"/>
            <parameters>
              <param name="ALARM_NUM" value="1"/>
              <param name="COMP16_NUM" value="2"/>
              <param name="COMP32_NUM" value="1"/>
              <param name="GCLK_ID" value="4"/>
              <param name="NUM_OF_ALARMS" value="1"/>
              <param name="NUM_OF_COMP16" value="2"/>
              <param name="NUM_OF_COMP32" value="1"/>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="2.0.0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA04"/>
              <signal group="PAD" index="0" function="C" pad="PA14"/>
              <signal group="PAD" index="1" function="D" pad="PA05"/>
              <signal group="PAD" index="1" function="C" pad="PA15"/>
              <signal group="PAD" index="2" function="D" pad="PA08"/>
              <signal group="PAD" index="2" function="C" pad="PA04"/>
              <signal group="PAD" index="3" function="D" pad="PA09"/>
              <signal group="PAD" index="3" function="C" pad="PA05"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="1"/>
              <param name="DMAC_ID_TX" value="2"/>
              <param name="GCLK_ID_CORE" value="14"/>
              <param name="GCLK_ID_SLOW" value="13"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="66"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="PAD" index="0" function="C" pad="PA30"/>
              <signal group="PAD" index="1" function="C" pad="PA31"/>
              <signal group="PAD" index="2" function="D" pad="PA30"/>
              <signal group="PAD" index="2" function="C" pad="PA24"/>
              <signal group="PAD" index="2" function="C" pad="PA08"/>
              <signal group="PAD" index="3" function="D" pad="PA31"/>
              <signal group="PAD" index="3" function="C" pad="PA25"/>
              <signal group="PAD" index="3" function="C" pad="PA09"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="3"/>
              <param name="DMAC_ID_TX" value="4"/>
              <param name="GCLK_ID_CORE" value="15"/>
              <param name="GCLK_ID_SLOW" value="13"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
        </module>
        <module name="SYSCTRL" id="U2100" version="2.0.2">
          <instance name="SYSCTRL">
            <register-group name="SYSCTRL" name-in-module="SYSCTRL" address-space="base" offset="0x40000800"/>
            <signals>
              <signal group="CAPLESS_EXTREF" function="VREG_TEST" pad="PA04"/>
              <signal group="CAPLESS_VDDCORE" function="VREG_TEST" pad="PA02"/>
              <signal group="ULPVREG_BODIIEN" function="VREG_TEST" pad="PA05"/>
              <signal group="ULPVREG_FORCELDO" function="VREG_TEST" pad="PA08"/>
              <signal group="ULPVREG_REQBIAS" function="VREG_TEST" pad="PA09"/>
              <signal group="VREG_ENABLE" function="VREG_TEST" pad="PA24"/>
              <signal group="XIN" function="XIN" pad="PA08"/>
              <signal group="XIN32" function="XIN32" pad="PA08"/>
              <signal group="XOSC_CLK" function="XOSC_TEST" pad="PA15"/>
              <signal group="XOSC_EN" function="XOSC_TEST" pad="PA14"/>
              <signal group="XOUT32" function="XOUT32" pad="PA09"/>
            </signals>
            <parameters>
              <param name="BGAP_CALIB_MSB" value="11"/>
              <param name="BOD12_CALIB_MSB" value="4"/>
              <param name="BOD33_CALIB_MSB" value="5"/>
              <param name="DFLL48M_COARSE_MSB" value="5"/>
              <param name="DFLL48M_FINE_MSB" value="9"/>
              <param name="GCLK_ID_DFLL48" value="0"/>
              <param name="GCLK_ID_FDPLL" value="1"/>
              <param name="GCLK_ID_FDPLL32K" value="2"/>
              <param name="OSC32K_COARSE_CALIB_MSB" value="6"/>
              <param name="POR33_ENTEST_MSB" value="1"/>
              <param name="SYSTEM_CLOCK" value="1000000"/>
              <param name="ULPVREF_DIVLEV_MSB" value="3"/>
              <param name="ULPVREG_FORCEGAIN_MSB" value="1"/>
              <param name="ULPVREG_RAMREFSEL_MSB" value="2"/>
              <param name="VREF_CONTROL_MSB" value="48"/>
              <param name="VREF_STATUS_MSB" value="7"/>
              <param name="VREG_LEVEL_MSB" value="2"/>
              <param name="BOD12_VERSION" value="0x111"/>
              <param name="BOD33_VERSION" value="0x111"/>
              <param name="DFLL48M_VERSION" value="0x300"/>
              <param name="FDPLL_VERSION" value="0x110"/>
              <param name="OSCULP32K_VERSION" value="0x111"/>
              <param name="OSC8M_VERSION" value="0x120"/>
              <param name="OSC32K_VERSION" value="0x110"/>
              <param name="VREF_VERSION" value="0x201"/>
              <param name="VREG_VERSION" value="0x201"/>
              <param name="XOSC_VERSION" value="0x112"/>
              <param name="XOSC32K_VERSION" value="0x111"/>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="TC" id="U2212" version="1.4.0">
          <instance name="TC1">
            <register-group name="TC1" name-in-module="TC" address-space="base" offset="0x42001800"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA04"/>
              <signal group="WO" index="0" function="E" pad="PA14"/>
              <signal group="WO" index="1" function="E" pad="PA05"/>
              <signal group="WO" index="1" function="E" pad="PA15"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="DMAC_ID_OVF" value="12"/>
              <param name="GCLK_ID" value="18"/>
              <param name="MASTER" value="1"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="70"/>
            </parameters>
          </instance>
          <instance name="TC2">
            <register-group name="TC2" name-in-module="TC" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA30"/>
              <signal group="WO" index="1" function="E" pad="PA31"/>
            </signals>
            <parameters>
              <param name="CC8_NUM" value="2"/>
              <param name="CC16_NUM" value="2"/>
              <param name="CC32_NUM" value="2"/>
              <param name="DITHERING_EXT" value="0"/>
              <param name="DMAC_ID_OVF" value="15"/>
              <param name="GCLK_ID" value="18"/>
              <param name="MASTER" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PERIOD_EXT" value="0"/>
              <param name="SHADOW_EXT" value="0"/>
              <param name="INSTANCE_ID" value="71"/>
            </parameters>
          </instance>
        </module>
        <module name="TCC" id="U2213" version="1.1.1">
          <instance name="TCC0">
            <register-group name="TCC0" name-in-module="TCC" address-space="base" offset="0x42001400"/>
            <signals>
              <signal group="WO" index="0" function="F" pad="PA04"/>
              <signal group="WO" index="0" function="F" pad="PA14"/>
              <signal group="WO" index="1" function="F" pad="PA05"/>
              <signal group="WO" index="1" function="F" pad="PA15"/>
              <signal group="WO" index="2" function="F" pad="PA30"/>
              <signal group="WO" index="2" function="E" pad="PA08"/>
              <signal group="WO" index="2" function="E" pad="PA24"/>
              <signal group="WO" index="3" function="F" pad="PA31"/>
              <signal group="WO" index="3" function="E" pad="PA09"/>
              <signal group="WO" index="3" function="E" pad="PA25"/>
              <signal group="WO" index="4" function="F" pad="PA24"/>
              <signal group="WO" index="4" function="F" pad="PA08"/>
              <signal group="WO" index="5" function="F" pad="PA25"/>
              <signal group="WO" index="5" function="F" pad="PA09"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="4"/>
              <param name="DITHERING" value="1"/>
              <param name="DMAC_ID_OVF" value="7"/>
              <param name="DTI" value="1"/>
              <param name="EXT" value="31"/>
              <param name="GCLK_ID" value="17"/>
              <param name="MASTER" value="0"/>
              <param name="OTMX" value="1"/>
              <param name="OW_NUM" value="8"/>
              <param name="PG" value="1"/>
              <param name="SIZE" value="24"/>
              <param name="SWAP" value="1"/>
              <param name="INSTANCE_ID" value="69"/>
            </parameters>
          </instance>
        </module>
